perf/output_heavy.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10000 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 10000 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.7s), 00007/10000 VUs, 20 complete and 0 interrupted iterations
default   [   1% ] 00007/10000 VUs  00.7s/50.0s

running (0m01.7s), 00017/10000 VUs, 125 complete and 0 interrupted iterations
default   [   3% ] 00017/10000 VUs  01.7s/50.0s

running (0m02.7s), 00027/10000 VUs, 328 complete and 0 interrupted iterations
default   [   5% ] 00027/10000 VUs  02.7s/50.0s

running (0m03.7s), 00037/10000 VUs, 618 complete and 0 interrupted iterations
default   [   7% ] 00037/10000 VUs  03.7s/50.0s

running (0m04.7s), 00047/10000 VUs, 1004 complete and 0 interrupted iterations
default   [   9% ] 00047/10000 VUs  04.7s/50.0s

running (0m05.7s), 00056/10000 VUs, 1469 complete and 0 interrupted iterations
default   [  11% ] 00056/10000 VUs  05.7s/50.0s

running (0m06.7s), 00066/10000 VUs, 1964 complete and 0 interrupted iterations
default   [  13% ] 00066/10000 VUs  06.7s/50.0s

running (0m07.7s), 00076/10000 VUs, 2604 complete and 0 interrupted iterations
default   [  15% ] 00076/10000 VUs  07.7s/50.0s

running (0m08.7s), 00086/10000 VUs, 3303 complete and 0 interrupted iterations
default   [  17% ] 00086/10000 VUs  08.7s/50.0s

running (0m09.7s), 00096/10000 VUs, 4078 complete and 0 interrupted iterations
default   [  19% ] 00096/10000 VUs  09.7s/50.0s

running (0m10.7s), 00315/10000 VUs, 5378 complete and 0 interrupted iterations
default   [  21% ] 00315/10000 VUs  10.7s/50.0s

running (0m11.7s), 00645/10000 VUs, 7459 complete and 0 interrupted iterations
default   [  23% ] 00645/10000 VUs  11.7s/50.0s

running (0m12.7s), 00974/10000 VUs, 9746 complete and 0 interrupted iterations
default   [  25% ] 00974/10000 VUs  12.7s/50.0s

running (0m13.7s), 01305/10000 VUs, 11986 complete and 0 interrupted iterations
default   [  27% ] 01305/10000 VUs  13.7s/50.0s

running (0m14.7s), 01634/10000 VUs, 14184 complete and 0 interrupted iterations
default   [  29% ] 01634/10000 VUs  14.7s/50.0s

running (0m15.7s), 01964/10000 VUs, 16426 complete and 0 interrupted iterations
default   [  31% ] 01964/10000 VUs  15.7s/50.0s

running (0m16.7s), 02295/10000 VUs, 18713 complete and 0 interrupted iterations
default   [  33% ] 02295/10000 VUs  16.7s/50.0s

running (0m17.7s), 02626/10000 VUs, 20767 complete and 0 interrupted iterations
default   [  35% ] 02626/10000 VUs  17.7s/50.0s

running (0m18.7s), 02955/10000 VUs, 22673 complete and 0 interrupted iterations
default   [  37% ] 02955/10000 VUs  18.7s/50.0s

running (0m19.7s), 03285/10000 VUs, 24508 complete and 0 interrupted iterations
default   [  39% ] 03285/10000 VUs  19.7s/50.0s

running (0m20.7s), 03615/10000 VUs, 26432 complete and 0 interrupted iterations
default   [  41% ] 03615/10000 VUs  20.7s/50.0s

running (0m21.7s), 03944/10000 VUs, 28454 complete and 0 interrupted iterations
default   [  43% ] 03944/10000 VUs  21.7s/50.0s

running (0m22.7s), 04274/10000 VUs, 30391 complete and 0 interrupted iterations
default   [  45% ] 04274/10000 VUs  22.7s/50.0s

running (0m23.7s), 04604/10000 VUs, 32509 complete and 0 interrupted iterations
default   [  47% ] 04604/10000 VUs  23.7s/50.0s

running (0m24.7s), 04934/10000 VUs, 34808 complete and 0 interrupted iterations
default   [  49% ] 04935/10000 VUs  24.7s/50.0s

running (0m25.7s), 05265/10000 VUs, 37204 complete and 0 interrupted iterations
default   [  51% ] 05265/10000 VUs  25.7s/50.0s

running (0m26.7s), 05595/10000 VUs, 39474 complete and 0 interrupted iterations
default   [  53% ] 05595/10000 VUs  26.7s/50.0s

running (0m27.7s), 05925/10000 VUs, 41775 complete and 0 interrupted iterations
default   [  55% ] 05925/10000 VUs  27.7s/50.0s

running (0m28.7s), 06255/10000 VUs, 43944 complete and 0 interrupted iterations
default   [  57% ] 06255/10000 VUs  28.7s/50.0s

running (0m29.7s), 06584/10000 VUs, 46322 complete and 0 interrupted iterations
default   [  59% ] 06585/10000 VUs  29.7s/50.0s

running (0m30.7s), 06915/10000 VUs, 48490 complete and 0 interrupted iterations
default   [  61% ] 06915/10000 VUs  30.7s/50.0s

running (0m31.7s), 07244/10000 VUs, 50831 complete and 0 interrupted iterations
default   [  63% ] 07244/10000 VUs  31.7s/50.0s

running (0m32.7s), 07574/10000 VUs, 53026 complete and 0 interrupted iterations
default   [  65% ] 07574/10000 VUs  32.7s/50.0s

running (0m33.7s), 07904/10000 VUs, 55002 complete and 0 interrupted iterations
default   [  67% ] 07904/10000 VUs  33.7s/50.0s

running (0m34.7s), 08235/10000 VUs, 57298 complete and 0 interrupted iterations
default   [  69% ] 08235/10000 VUs  34.7s/50.0s

running (0m35.7s), 08565/10000 VUs, 59580 complete and 0 interrupted iterations
default   [  71% ] 08565/10000 VUs  35.7s/50.0s

running (0m36.7s), 08894/10000 VUs, 61911 complete and 0 interrupted iterations
default   [  73% ] 08894/10000 VUs  36.7s/50.0s

running (0m37.7s), 09224/10000 VUs, 63990 complete and 0 interrupted iterations
default   [  75% ] 09225/10000 VUs  37.7s/50.0s

running (0m38.7s), 09555/10000 VUs, 66331 complete and 0 interrupted iterations
default   [  77% ] 09555/10000 VUs  38.7s/50.0s

running (0m39.7s), 09886/10000 VUs, 68567 complete and 0 interrupted iterations
default   [  79% ] 09886/10000 VUs  39.7s/50.0s

running (0m40.7s), 10000/10000 VUs, 71065 complete and 0 interrupted iterations
default   [  81% ] 10000/10000 VUs  40.7s/50.0s

running (0m41.7s), 10000/10000 VUs, 73263 complete and 0 interrupted iterations
default   [  83% ] 10000/10000 VUs  41.7s/50.0s

running (0m42.7s), 09997/10000 VUs, 75255 complete and 0 interrupted iterations
default   [  85% ] 09997/10000 VUs  42.7s/50.0s

running (0m43.7s), 09655/10000 VUs, 77453 complete and 0 interrupted iterations
default   [  87% ] 09655/10000 VUs  43.7s/50.0s

running (0m44.7s), 09019/10000 VUs, 79526 complete and 0 interrupted iterations
default   [  89% ] 09019/10000 VUs  44.7s/50.0s

running (0m45.7s), 08112/10000 VUs, 81569 complete and 0 interrupted iterations
default   [  91% ] 08112/10000 VUs  45.7s/50.0s

running (0m46.7s), 06960/10000 VUs, 83925 complete and 0 interrupted iterations
default   [  93% ] 06960/10000 VUs  46.7s/50.0s

running (0m47.7s), 05621/10000 VUs, 86334 complete and 0 interrupted iterations
default   [  95% ] 05621/10000 VUs  47.7s/50.0s

running (0m48.7s), 04248/10000 VUs, 88621 complete and 0 interrupted iterations
default   [  97% ] 04248/10000 VUs  48.7s/50.0s

running (0m49.7s), 02711/10000 VUs, 90830 complete and 0 interrupted iterations
default   [  99% ] 02711/10000 VUs  49.7s/50.0s

running (0m50.7s), 01806/10000 VUs, 91817 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m51.7s), 01806/10000 VUs, 91817 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m52.7s), 01806/10000 VUs, 91817 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m53.7s), 01806/10000 VUs, 91817 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m54.7s), 01806/10000 VUs, 91817 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m55.7s), 01806/10000 VUs, 91817 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m56.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m57.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m58.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (0m59.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m00.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m01.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m02.7s), 01798/10000 VUs, 91825 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m03.7s), 01797/10000 VUs, 91826 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m04.7s), 01797/10000 VUs, 91826 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m05.7s), 01572/10000 VUs, 92051 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m06.7s), 01242/10000 VUs, 92381 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m07.7s), 00924/10000 VUs, 92699 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m08.7s), 00615/10000 VUs, 93008 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m09.7s), 00309/10000 VUs, 93314 complete and 0 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m10.7s), 00117/10000 VUs, 93439 complete and 67 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m11.7s), 00096/10000 VUs, 93439 complete and 88 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m12.7s), 00004/10000 VUs, 93440 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m13.7s), 00004/10000 VUs, 93440 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m14.7s), 00004/10000 VUs, 93440 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m15.7s), 00004/10000 VUs, 93440 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m16.7s), 00003/10000 VUs, 93441 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m17.7s), 00003/10000 VUs, 93441 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m18.7s), 00002/10000 VUs, 93442 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

running (1m19.7s), 00002/10000 VUs, 93442 complete and 179 interrupted iterations
default ↓ [ 100% ] 02102/10000 VUs  50s

     ✗ status is 200
      ↳  98% — ✓ 91817 / ✗ 1650

     checks.........................: 98.23% 91817 out of 93467
     data_received..................: 19 MB  236 kB/s
     data_sent......................: 7.7 MB 97 kB/s
     http_req_blocked...............: avg=724.48µs min=0s       med=4.74µs  max=11.2s  p(90)=17.99µs p(95)=222.49µs
     http_req_connecting............: avg=712.43µs min=0s       med=0s      max=11.2s  p(90)=0s      p(95)=154.45µs
     http_req_duration..............: avg=2.11s    min=0s       med=2.15s   max=15.43s p(90)=3.57s   p(95)=3.7s    
       { expected_response:true }...: avg=2.14s    min=3.13ms   med=2.24s   max=15.43s p(90)=3.57s   p(95)=3.7s    
     http_req_failed................: 1.76%  1650 out of 93467
     http_req_receiving.............: avg=46.27µs  min=0s       med=35.33µs max=4.88ms p(90)=68.6µs  p(95)=93.58µs 
     http_req_sending...............: avg=18.87µs  min=0s       med=11.1µs  max=4.95ms p(90)=35.68µs p(95)=50.53µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s     p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=2.11s    min=0s       med=2.15s   max=15.43s p(90)=3.57s   p(95)=3.7s    
     http_reqs......................: 93467  1168.581708/s
     iteration_duration.............: avg=2.73s    min=103.64ms med=2.39s   max=30.1s  p(90)=3.69s   p(95)=3.83s   
     iterations.....................: 93443  1168.281645/s
     vus............................: 2      min=2              max=10000
     vus_max........................: 10000  min=10000          max=10000


running (1m20.0s), 00000/10000 VUs, 93443 complete and 180 interrupted iterations
default ✓ [ 100% ] 00000/10000 VUs  50s